[
    {
      "id": 1,
      "name": "Aquaris",
      "species_name": "Water Dragon",
      "stage": "adult",
      "description": "A majestic water dragon with scales that shimmer like the ocean surface. Known for its ability to breathe underwater and control water currents.",
      "habitat_type": "ocean",
      "rarity": "rare",
      "health": 80,
      "happiness": 90,
      "growth_progress": 60,
      "owned": true,
      "real_world_inspiration": "Inspired by the endangered Leatherback Sea Turtle, the largest sea turtle species that can dive to depths of over 1,000 meters.",
      "conservation_fact": "Leatherback Sea Turtles are critically endangered due to plastic pollution, fishing net entanglement, and habitat loss. Their population has declined by over 80% in the last century.",
      "last_interaction_at": "2023-11-20 15:30:00",
      "image_urls": {
        "egg": "/Wildlife/images/creatures/1_egg.png",
        "baby": "/Wildlife/images/creatures/1_baby.png",
        "juvenile": "/Wildlife/images/creatures/1_juvenile.png",
        "adult": "/Wildlife/images/creatures/1_adult.png",
        "mythical": "/Wildlife/images/creatures/1_mythical.png"
      },
      "audio_url": "/Wildlife/audio/creatures/aquaris.mp3",
      "exhibition_note": "Aquaris embodies the fluidity of life and the depths of emotion. Its shimmering scales represent the ever-changing surface of human experience, while its water-breathing ability symbolizes adaptability in challenging environments."
    },
    {
      "id": 2,
      "name": "Starshifter",
      "species_name": "Cosmic Wyvern",
      "stage": "mythical",
      "description": "A celestial dragon whose scales contain the light of distant stars. It can traverse space and time, leaving trails of stardust in its wake.",
      "habitat_type": "cosmic",
      "rarity": "mythical",
      "health": 100,
      "happiness": 100,
      "growth_progress": 100,
      "owned": true,
      "real_world_inspiration": "Inspired by the Amur Leopard, one of the world's most endangered big cats with fewer than 100 individuals remaining in the wild.",
      "conservation_fact": "The Amur Leopard faces threats from poaching, habitat loss, and fragmentation. Conservation efforts include anti-poaching measures and habitat protection in Russia and China.",
      "last_interaction_at": "2023-11-21 09:15:00",
      "image_urls": {
        "egg": "/Wildlife/images/creatures/2_egg.png",
        "baby": "/Wildlife/images/creatures/2_baby.png",
        "juvenile": "/Wildlife/images/creatures/2_juvenile.png",
        "adult": "/Wildlife/images/creatures/2_adult.png",
        "mythical": "/Wildlife/images/creatures/2_mythical.png"
      },
      "audio_url": "/Wildlife/audio/creatures/starshifter.mp3",
      "exhibition_note": "Starshifter represents our connection to the cosmos and our yearning to explore beyond our known boundaries. Its ability to traverse space and time invites viewers to contemplate their place in the universe and the infinite possibilities that exist beyond our perception."
    },
    {
      "id": 3,
      "name": "Leafling",
      "species_name": "Forest Sprite",
      "stage": "baby",
      "description": "A small woodland creature with leaves growing from its body. It can blend perfectly with forest foliage and communicate with plants.",
      "habitat_type": "forest",
      "rarity": "common",
      "health": 95,
      "happiness": 85,
      "growth_progress": 45,
      "owned": true,
      "real_world_inspiration": "Inspired by the Giant Panda, a beloved symbol of wildlife conservation that relies on bamboo forests for survival.",
      "conservation_fact": "While Giant Panda populations have increased slightly in recent years thanks to conservation efforts, they remain vulnerable due to habitat fragmentation and limited bamboo resources.",
      "last_interaction_at": "2023-11-22 11:45:00",
      "image_urls": {
        "egg": "/Wildlife/images/creatures/3_egg.png",
        "baby": "/Wildlife/images/creatures/3_baby.png",
        "juvenile": "/Wildlife/images/creatures/3_juvenile.png",
        "adult": "/Wildlife/images/creatures/3_adult.png",
        "mythical": "/Wildlife/images/creatures/3_mythical.png"
      },
      "audio_url": "/Wildlife/audio/creatures/leafling.mp3",
      "exhibition_note": "Leafling symbolizes our innate connection to nature and the innocence of youth. Its delicate form and ability to communicate with plants remind us of the importance of listening to the natural world around us, a skill often lost in modern society."
    },
    {
      "id": 4,
      "name": "Mystery Egg",
      "species_name": "Unknown",
      "stage": "egg",
      "description": "A mysterious egg with a tough, stone-like shell that occasionally emits a warm glow. The creature inside seems to be growing stronger.",
      "habitat_type": "mountain",
      "rarity": "uncommon",
      "health": 100,
      "happiness": 100,
      "growth_progress": 85,
      "owned": true,
      "real_world_inspiration": "Inspired by the Snow Leopard, a highly elusive big cat adapted to the harsh mountain environments of Central Asia.",
      "conservation_fact": "Snow Leopards face threats from poaching, retaliatory killings by herders, and habitat loss. There are estimated to be fewer than 10,000 mature individuals left in the wild.",
      "last_interaction_at": null,
      "image_urls": {
        "egg": "/Wildlife/images/creatures/4_egg.png",
        "baby": "/Wildlife/images/creatures/4_baby.png",
        "juvenile": "/Wildlife/images/creatures/4_juvenile.png",
        "adult": "/Wildlife/images/creatures/4_adult.png",
        "mythical": "/Wildlife/images/creatures/4_mythical.png"
      },
      "audio_url": "/Wildlife/audio/creatures/mystery_egg.mp3",
      "exhibition_note": "The Mystery Egg represents the unknown potential within each of us. Its stone-like exterior contrasts with the warm glow it occasionally emits, suggesting that strength and resilience often hide unexpected warmth and beauty."
    },
    {
      "id": 5,
      "name": "Skyweaver",
      "species_name": "Wind Serpent",
      "stage": "juvenile",
      "description": "A graceful serpentine creature that glides through the air by manipulating wind currents. Its body is almost transparent with subtle blue hues.",
      "habitat_type": "sky",
      "rarity": "rare",
      "health": 75,
      "happiness": 92,
      "growth_progress": 70,
      "owned": false,
      "real_world_inspiration": "Inspired by the Philippine Eagle, one of the largest and most powerful birds of prey, critically endangered with fewer than 400 pairs remaining.",
      "conservation_fact": "The Philippine Eagle faces threats from deforestation, hunting, and climate change. Each breeding pair requires a large territory of old-growth forest to survive.",
      "last_interaction_at": "2023-11-19 16:20:00",
      "image_urls": {
        "egg": "/Wildlife/images/creatures/5_egg.png",
        "baby": "/Wildlife/images/creatures/5_baby.png",
        "juvenile": "/Wildlife/images/creatures/5_juvenile.png",
        "adult": "/Wildlife/images/creatures/5_adult.png",
        "mythical": "/Wildlife/images/creatures/5_mythical.png"
      },
      "audio_url": "/Wildlife/audio/creatures/skyweaver.mp3",
      "exhibition_note": "Skyweaver captures the essence of freedom and the ethereal quality of dreams. Its nearly transparent body represents the fine line between reality and imagination, while its ability to manipulate wind speaks to the unseen forces that shape our lives."
    },
    {
      "id": 6,
      "name": "Emberhorn",
      "species_name": "Lava Stag",
      "stage": "adult",
      "description": "A majestic stag with antlers of molten lava and hooves that leave smoldering footprints. Despite its fiery appearance, it's gentle and protective.",
      "habitat_type": "mountain",
      "rarity": "uncommon",
      "health": 88,
      "happiness": 76,
      "growth_progress": 50,
      "owned": false,
      "real_world_inspiration": "Inspired by the Saola, often called the 'Asian unicorn' - one of the world's rarest mammals discovered only in 1992.",
      "conservation_fact": "The Saola is critically endangered and notoriously difficult to study. Scientists estimate fewer than 100 individuals remain in the forests of Vietnam and Laos.",
      "last_interaction_at": "2023-11-18 10:05:00",
      "image_urls": {
        "egg": "/Wildlife/images/creatures/6_egg.png",
        "baby": "/Wildlife/images/creatures/6_baby.png",
        "juvenile": "/Wildlife/images/creatures/6_juvenile.png",
        "adult": "/Wildlife/images/creatures/6_adult.png",
        "mythical": "/Wildlife/images/creatures/6_mythical.png"
      },
      "audio_url": "/Wildlife/audio/creatures/emberhorn.mp3",
      "exhibition_note": "Emberhorn embodies the duality of strength and gentleness. Its fiery antlers and smoldering hooves represent passion and intensity, while its protective nature reminds us that true power lies in how we care for others rather than in displays of force."
    },
    {
      "id": 7,
      "name": "Whisperleaf",
      "species_name": "Enchanted Fern",
      "stage": "juvenile",
      "description": "A sentient plant-creature that communicates through soft rustling sounds. Its leaves glow with magical light when it's happy.",
      "habitat_type": "enchanted",
      "rarity": "uncommon",
      "health": 92,
      "happiness": 96,
      "growth_progress": 65,
      "owned": false,
      "real_world_inspiration": "Inspired by the Venus Flytrap, one of the world's most famous carnivorous plants native to a small region in North and South Carolina.",
      "conservation_fact": "Wild Venus Flytraps are vulnerable due to habitat loss and poaching for the plant trade. They only naturally grow in a small area of about 120 square kilometers.",
      "last_interaction_at": "2023-11-17 14:30:00",
      "image_urls": {
        "egg": "/Wildlife/images/creatures/7_egg.png",
        "baby": "/Wildlife/images/creatures/7_baby.png",
        "juvenile": "/Wildlife/images/creatures/7_juvenile.png",
        "adult": "/Wildlife/images/creatures/7_adult.png",
        "mythical": "/Wildlife/images/creatures/7_mythical.png"
      },
      "audio_url": "/Wildlife/audio/creatures/whisperleaf.mp3",
      "exhibition_note": "Whisperleaf invites us to listen more closely to the quiet voices around us. Its method of communication—soft rustling sounds—reminds us that wisdom often comes in whispers rather than shouts, and that joy can manifest as a subtle inner glow rather than an ostentatious display."
    },
    {
      "id": 8,
      "name": "Corallium",
      "species_name": "Reef Guardian",
      "stage": "egg",
      "description": "This rare egg pulses with blue and pink light, and seems to be growing a protective coral-like shell. Something powerful sleeps inside.",
      "habitat_type": "ocean",
      "rarity": "legendary",
      "health": 100,
      "happiness": 100,
      "growth_progress": 25,
      "owned": false,
      "real_world_inspiration": "Inspired by coral reefs, which are living organisms that provide habitat for nearly 25% of all marine species despite covering less than 1% of the ocean floor.",
      "conservation_fact": "Coral reefs worldwide are threatened by climate change, ocean acidification, pollution, and destructive fishing practices. Some regions have lost over 50% of their coral coverage in recent decades.",
      "last_interaction_at": null,
      "image_urls": {
        "egg": "/Wildlife/images/creatures/8_egg.png",
        "baby": "/Wildlife/images/creatures/8_baby.png",
        "juvenile": "/Wildlife/images/creatures/8_juvenile.png",
        "adult": "/Wildlife/images/creatures/8_adult.png",
        "mythical": "/Wildlife/images/creatures/8_mythical.png"
      },
      "audio_url": "/Wildlife/audio/creatures/corallium.mp3",
      "exhibition_note": "Corallium's egg form represents beginnings and the fragile beauty of nascent life. Its pulsing light symbolizes the heartbeat of the ocean itself, while its coral-like shell reminds us that even the most delicate structures can build magnificent ecosystems when given time and protection."
    },
    {
      "id": 9,
      "name": "Lunaris",
      "species_name": "Moon Owl",
      "stage": "baby",
      "description": "A small owl with feathers that shimmer like moonlight. Its eyes appear to contain tiny galaxies, and it hoots in a musical, ethereal tone.",
      "habitat_type": "cosmic",
      "rarity": "rare",
      "health": 85,
      "happiness": 90,
      "growth_progress": 30,
      "owned": false,
      "real_world_inspiration": "Inspired by the endangered Blakiston's Fish Owl, the largest owl species which needs old-growth forests near clean rivers to survive.",
      "conservation_fact": "Blakiston's Fish Owls are endangered with only a few thousand remaining in Russia, China, and Japan. They require large territories with old trees for nesting and unpolluted rivers for fishing.",
      "last_interaction_at": "2023-11-16 18:45:00",
      "image_urls": {
        "egg": "/Wildlife/images/creatures/9_egg.png",
        "baby": "/Wildlife/images/creatures/9_baby.png",
        "juvenile": "/Wildlife/images/creatures/9_juvenile.png",
        "adult": "/Wildlife/images/creatures/9_adult.png",
        "mythical": "/Wildlife/images/creatures/9_mythical.png"
      },
      "audio_url": "/Wildlife/audio/creatures/lunaris.mp3",
      "exhibition_note": "Lunaris embodies wisdom and mystery. Its galaxy-filled eyes suggest that knowledge comes from looking both outward to the stars and inward to our own cosmic nature. The musical quality of its hoot reminds us that wisdom often comes to those who can hear the universe's subtle harmonies."
    },
    {
      "id": 10,
      "name": "Thornheart",
      "species_name": "Forest Guardian",
      "stage": "mythical",
      "description": "An ancient woodland spirit with bark-like skin and branches growing from its shoulders. It can command nearby plants and trees to protect the forest.",
      "habitat_type": "forest",
      "rarity": "legendary",
      "health": 100,
      "happiness": 100,
      "growth_progress": 100,
      "owned": false,
      "real_world_inspiration": "Inspired by the Sumatran Orangutan, a critically endangered great ape that spends most of its life in the trees of Indonesian rainforests.",
      "conservation_fact": "Sumatran Orangutans have lost over 80% of their habitat in the last 50 years, primarily due to palm oil plantations, logging, and human encroachment.",
      "last_interaction_at": "2023-11-15 12:10:00",
      "image_urls": {
        "egg": "/Wildlife/images/creatures/10_egg.png",
        "baby": "/Wildlife/images/creatures/10_baby.png",
        "juvenile": "/Wildlife/images/creatures/10_juvenile.png",
        "adult": "/Wildlife/images/creatures/10_adult.png",
        "mythical": "/Wildlife/images/creatures/10_mythical.png"
      },
      "audio_url": "/Wildlife/audio/creatures/thornheart.mp3",
      "exhibition_note": "Thornheart represents the ancient wisdom of the forest and our responsibility as stewards of the natural world. Its ability to command plants and trees symbolizes humanity's choice to either protect or destroy the environment. The branches growing from its shoulders suggest that we are not separate from nature but extensions of it."
    },
    {
      "id": 11,
      "name": "Shimmerscale",
      "species_name": "Crystal Serpent",
      "stage": "adult",
      "description": "A serpent with scales made of living crystal that change color with its mood. It can channel magical energies and create dazzling light displays.",
      "habitat_type": "enchanted",
      "rarity": "rare",
      "health": 94,
      "happiness": 88,
      "growth_progress": 75,
      "owned": true,
      "real_world_inspiration": "Inspired by the Chinese Giant Salamander, the world's largest amphibian that can grow up to 6 feet long.",
      "conservation_fact": "Chinese Giant Salamanders are critically endangered due to habitat destruction, pollution, and over-harvesting for traditional medicine and food. Wild populations have declined by over 80% since the 1950s.",
      "last_interaction_at": "2023-11-14 09:30:00",
      "image_urls": {
        "egg": "/Wildlife/images/creatures/11_egg.png",
        "baby": "/Wildlife/images/creatures/11_baby.png",
        "juvenile": "/Wildlife/images/creatures/11_juvenile.png",
        "adult": "/Wildlife/images/creatures/11_adult.png",
        "mythical": "/Wildlife/images/creatures/11_mythical.png"
      },
      "audio_url": "/Wildlife/audio/creatures/shimmerscale.mp3",
      "exhibition_note": "Shimmerscale represents emotional authenticity and the beauty of vulnerability. Its crystal scales changing color with its mood remind us that there is power in expressing our true feelings rather than hiding them. The dazzling light displays it creates suggest that emotional honesty illuminates not only our own path but also brightens the world for others."
    },
    {
      "id": 12,
      "name": "Cloudracer",
      "species_name": "Sky Dolphin",
      "stage": "juvenile",
      "description": "A playful creature that resembles a dolphin but swims through the air instead of water. It can create small rainclouds when excited.",
      "habitat_type": "sky",
      "rarity": "uncommon",
      "health": 82,
      "happiness": 95,
      "growth_progress": 60,
      "owned": true,
      "real_world_inspiration": "Inspired by the Vaquita, the world's most endangered marine mammal with fewer than 10 individuals remaining in the wild.",
      "conservation_fact": "The Vaquita's population has collapsed due to illegal fishing practices in the Gulf of California. Despite protection efforts, their numbers continue to decline dramatically.",
      "last_interaction_at": "2023-11-13 15:50:00",
      "image_urls": {
        "egg": "/Wildlife/images/creatures/12_egg.png",
        "baby": "/Wildlife/images/creatures/12_baby.png",
        "juvenile": "/Wildlife/images/creatures/12_juvenile.png",
        "adult": "/Wildlife/images/creatures/12_adult.png",
        "mythical": "/Wildlife/images/creatures/12_mythical.png"
      },
      "audio_url": "/Wildlife/audio/creatures/cloudracer.mp3",
      "exhibition_note": "Cloudracer embodies joy and the importance of play throughout life. Its ability to swim through air rather than water represents thinking beyond conventional limitations, while the small rainclouds it creates when excited remind us that authentic emotions, even when overwhelming, bring necessary nourishment to the world."
    }
  ]